<?php
/**
 * 权限管理
 */
return [
    'login' =>[
        'index' => '登录后台',
        'login' => '登录后台',
        'logout' => '退出后台',
    ],
    'index' =>[
        'index' => '查看后台首页',
        'clear' => '清除缓存',
        'system'  => '操作系统设置',
    ],
    'article' =>[
        'index' => '查看文章列表',
        'add'   => '添加文章',
        'edit'  => '编辑文章',
        'dele'  => '删除文章',
        'move'  => '移动文章分类',
    ],
    'product' =>[
        'index' => '查看产品列表',
        'add'   => '添加产品',
        'edit'  => '编辑产品',
        'dele'  => '删除产品',
        'move'  => '移动产品分类',
        'upload' => '产品上传图片'
    ],
    'page' =>[
        'index' => '查看单页列表',
        'add'   => '修改单页',
        'edit'  => '编辑单页',
        'dele'  => '删除单页',
    ],
    'nav' =>[
        'index' => '查看导航列表',
        'add'   => '添加导航',
        'edit'  => '编辑导航',
        'dele'  => '删除导航',
    ],
    'main' =>[
        'index' => '查看首页',
        'upload' => '上传图片'
    ],
    'admin' =>[
        'index' => '查看网站管理员首页',
        'add' => '添加管理员',
        'edit' => '编辑管理员信息',
        'dele' => '删除管理员'
    ],
    'log' =>[
        'index' => '查看操作记录首页',
    ],
];
